In [108]:
import gc
from tqdm.notebook import tqdm

import numpy as np
import pandas as pd
import seaborn as sns

import matplotlib.pyplot as plt
%matplotlib inline

# 한글 폰트 사용을 위해서 세팅
from matplotlib import font_manager, rc
font_path = "C:/Windows/Fonts/H2GTRM.TTF"
font = font_manager.FontProperties(fname=font_path).get_name()

plt.rc('font', family = font)
plt.rc('axes', unicode_minus=False)

# 외국인 인구

In [109]:
waste=pd.read_csv("eco jeju/01_음식물쓰레기_FOOD_WASTE_210811_update.csv",encoding="cp949")

C:\Users\lg_gram\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [110]:
frgn_long=pd.read_csv("eco jeju/02-2_장기체류 외국인 유동인구_LONG_TERM_FRGN.csv",encoding="cp949")

In [111]:
frgn_short=pd.read_csv("eco jeju/02-3_단기체류 외국인 유동인구_SHORT_TERM_FRGN.csv",encoding="cp949")

In [151]:
short_df = frgn_short.groupby(['base_date','emd_nm'])[['visit_pop_cnt']].mean().reset_index()
short_df.rename(columns={'visit_pop_cnt':'short_visit_pop'},inplace=True)
short_df

        base_date emd_nm  short_visit_pop
0      2018-01-01    건입동        26.248146
1      2018-01-01    구좌읍        17.154034
2      2018-01-01    남원읍        20.773841
3      2018-01-01    노형동        53.633532
4      2018-01-01    대륜동        10.523813
...           ...    ...              ...
53711  2021-06-30    표선면         1.198136
53712  2021-06-30    한경면         0.657416
53713  2021-06-30    한림읍         0.701236
53714  2021-06-30    화북동         1.327803
53715  2021-06-30    효돈동         0.921200

[53716 rows x 3 columns]

In [154]:
long_df = frgn_long.groupby(['base_date', 'emd_nm'])[['resd_pop_cnt', 'work_pop_cnt', 'visit_pop_cnt']].mean().reset_index()
long_df

        base_date emd_nm  resd_pop_cnt  work_pop_cnt  visit_pop_cnt
0      2018-01-01    건입동     12.226698      2.179820      13.054703
1      2018-01-01    구좌읍     13.681149      1.372111       6.322790
2      2018-01-01    남원읍     16.354599      2.403829       5.165862
3      2018-01-01    노형동     67.677266      4.825817      17.674662
4      2018-01-01    대륜동      8.031951      0.586331       7.365770
...           ...    ...           ...           ...            ...
54906  2021-06-30    표선면      5.954509      0.803698       4.954526
54907  2021-06-30    한경면     11.465143      0.519235       9.524160
54908  2021-06-30    한림읍     28.695899      1.647876      17.284778
54909  2021-06-30    화북동     11.496794      1.525192       4.133723
54910  2021-06-30    효돈동      4.062940      0.361014       3.258625

[54911 rows x 5 columns]

In [188]:
long_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54911 entries, 0 to 54910
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   base_date      54911 non-null  object
 1   emd_nm         54911 non-null  object
 2   resd_pop_cnt   54911 non-null  float64
 3   work_pop_cnt   54911 non-null  float64
 4   visit_pop_cnt  54911 non-null  float64
dtypes: float64(3), object(2)
memory usage: 2.1+ MB

In [155]:
frgn=pd.merge(short_df,long_df,left_on=['base_date','emd_nm'],right_on=['base_date', 'emd_nm'],how='right')
frgn

,base_date,emd_nm,short_visit_pop,resd_pop_cnt,work_pop_cnt,visit_pop_cnt
0,2018-01-01,건입동,26.248146,12.226698,2.179820,13.054703
1,2018-01-01,구좌읍,17.154034,13.681149,1.372111,6.322790
2,2018-01-01,남원읍,20.773841,16.354599,2.403829,5.165862
3,2018-01-01,노형동,53.633532,67.677266,4.825817,17.674662
4,2018-01-01,대륜동,10.523813,8.031951,0.586331,7.365770
...,...,...,...,...,...,...
54906,2021-06-30,표선면,1.198136,5.954509,0.803698,4.954526
54907,2021-06-30,한경면,0.657416,11.465143,0.519235,9.524160
54908,2021-06-30,한림읍,0.701236,28.695899,1.647876,17.284778
54909,2021-06-30,화북동,1.327803,11.496794,1.525192,4.133723
54910,2021-06-30,효돈동,0.921200,4.062940,0.361014,3.258625

In [190]:
frgn=frgn.fillna(0)

In [191]:
frgn['total_frgn_pop']=frgn['short_visit_pop']+frgn['resd_pop_cnt']+frgn['work_pop_cnt']+frgn['visit_pop_cnt']
frgn

,base_date,emd_nm,short_visit_pop,resd_pop_cnt,work_pop_cnt,visit_pop_cnt,total_frgn_pop
0,2018-01-01,건입동,26.248146,12.226698,2.179820,13.054703,53.709367
1,2018-01-01,구좌읍,17.154034,13.681149,1.372111,6.322790,38.530083
2,2018-01-01,남원읍,20.773841,16.354599,2.403829,5.165862,44.698131
3,2018-01-01,노형동,53.633532,67.677266,4.825817,17.674662,143.811278
4,2018-01-01,대륜동,10.523813,8.031951,0.586331,7.365770,26.507865
...,...,...,...,...,...,...,...
54906,2021-06-30,표선면,1.198136,5.954509,0.803698,4.954526,12.910869
54907,2021-06-30,한경면,0.657416,11.465143,0.519235,9.524160,22.165953
54908,2021-06-30,한림읍,0.701236,28.695899,1.647876,17.284778,48.329788
54909,2021-06-30,화북동,1.327803,11.496794,1.525192,4.133723,18.483512
54910,2021-06-30,효돈동,0.921200,4.062940,0.361014,3.258625,8.603778

In [192]:
frgn.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 54911 entries, 0 to 54910
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   base_date        54911 non-null  object
 1   emd_nm           54911 non-null  object
 2   short_visit_pop  54911 non-null  float64
 3   resd_pop_cnt     54911 non-null  float64
 4   work_pop_cnt     54911 non-null  float64
 5   visit_pop_cnt    54911 non-null  float64
 6   total_frgn_pop   54911 non-null  float64
dtypes: float64(5), object(2)
memory usage: 3.4+ MB

In [193]:
total_frgn=frgn[['base_date','emd_nm','total_frgn_pop']]

In [194]:
total_frgn.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 54911 entries, 0 to 54910
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   base_date       54911 non-null  object
 1   emd_nm          54911 non-null  object
 2   total_frgn_pop  54911 non-null  float64
dtypes: float64(1), object(2)
memory usage: 1.7+ MB

In [195]:
total_frgn

        base_date emd_nm  total_frgn_pop
0      2018-01-01    건입동       53.709367
1      2018-01-01    구좌읍       38.530083
2      2018-01-01    남원읍       44.698131
3      2018-01-01    노형동      143.811278
4      2018-01-01    대륜동       26.507865
...           ...    ...             ...
54906  2021-06-30    표선면       12.910869
54907  2021-06-30    한경면       22.165953
54908  2021-06-30    한림읍       48.329788
54909  2021-06-30    화북동       18.483512
54910  2021-06-30    효돈동        8.603778

[54911 rows x 3 columns]

In [196]:
total = total_frgn.groupby(['base_date'])[['total_frgn_pop']].sum().reset_index()
total['emd_nm'] = '전체'
total

       base_date  total_frgn_pop emd_nm
0     2018-01-01     2215.223209     전체
1     2018-01-02     2221.350506     전체
2     2018-01-03     2172.085577     전체
3     2018-01-04     2111.044522     전체
4     2018-01-05     2055.834760     전체
...          ...             ...    ...
1272  2021-06-26     1017.363470     전체
1273  2021-06-27     1003.190708     전체
1274  2021-06-28     1011.799786     전체
1275  2021-06-29     1035.339082     전체
1276  2021-06-30     1015.214485     전체

[1277 rows x 3 columns]

In [197]:
newt = pd.concat([total_frgn , total]).reset_index(drop = True)

In [198]:
newt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56188 entries, 0 to 56187
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   base_date       56188 non-null  object
 1   emd_nm          56188 non-null  object
 2   total_frgn_pop  56188 non-null  float64
dtypes: float64(1), object(2)
memory usage: 1.3+ MB

In [199]:
newt.loc[(newt['base_date']=='2020-02-07') & (newt['emd_nm']=='일도1동')]

        base_date emd_nm  total_frgn_pop
33011  2020-02-07   일도1동        6.625207

In [200]:
newt.isnull().sum()

base_date         0
emd_nm            0
total_frgn_pop    0
dtype: int64

# 청년 인구

In [ ]:
korean=pd.read_pickle("eco jeju/02-1_내국인유동인구_KOREAN.pickle")

In [126]:
korean.head(10)

,base_date,time,city,emd_cd,emd_nm,sex,age,resd_pop_cnt,work_pop_cnt,visit_pop_cnt,resd,total
0,2018-01-01,1,제주시,50110250,한림읍,여성,0,638.5509,15.5400,151.5149,제주,805.6058
1,2018-01-01,1,제주시,50110250,한림읍,여성,0,0.0000,3.7249,171.3458,그외,175.0707
2,2018-01-01,1,제주시,50110250,한림읍,여성,10,668.4577,17.0308,166.0500,제주,851.5385
3,2018-01-01,1,제주시,50110250,한림읍,여성,10,0.0000,4.2577,195.8539,그외,200.1116
4,2018-01-01,1,제주시,50110250,한림읍,여성,20,609.7710,5.9490,148.7246,제주,764.4446
5,2018-01-01,1,제주시,50110250,한림읍,여성,20,0.0000,8.9235,359.9136,그외,368.8371
6,2018-01-01,1,제주시,50110250,한림읍,여성,30,1002.1208,10.1911,217.4093,제주,1229.7212
7,2018-01-01,1,제주시,50110250,한림읍,여성,30,0.0000,0.0000,478.9798,그외,478.9798
8,2018-01-01,1,제주시,50110250,한림읍,여성,40,1530.5014,38.2625,292.1866,제주,1860.9505
9,2018-01-01,1,제주시,50110250,한림읍,여성,40,0.0000,13.9136,340.8844,그외,354.7980

In [127]:
korean['total'] = korean.resd_pop_cnt + korean.work_pop_cnt + korean.visit_pop_cnt
data = korean.groupby(['base_date','emd_nm','age'])[['total']].mean().reset_index()
data

        base_date emd_nm  age       total
0      2018-01-01    건입동    0  346.664382
1      2018-01-01    건입동   10  394.433470
2      2018-01-01    건입동   20  455.317890
3      2018-01-01    건입동   30  512.533308
4      2018-01-01    건입동   40  686.151531
...           ...    ...  ...         ...
494194 2021-06-30    효돈동   40  217.537528
494195 2021-06-30    효돈동   50  257.268985
494196 2021-06-30    효돈동   60  206.961295
494197 2021-06-30    효돈동   70  133.701384
494198 2021-06-30    효돈동   80   76.274564

[494199 rows x 4 columns]

In [128]:
youth=data.query('age == [20, 30]').groupby(['base_date','emd_nm'])['total'].sum().reset_index()

In [129]:
y_tot = youth.groupby(['base_date'])[['total']].sum().reset_index()
y_tot['emd_nm'] = '전체'

In [130]:
y_tot

      base_date         total emd_nm
0    2018-01-01  54466.952499     전체
1    2018-01-02  53973.690842     전체
2    2018-01-03  53705.165769     전체
3    2018-01-04  53151.118467     전체
4    2018-01-05  53360.869746     전체
...         ...           ...    ...
1272 2021-06-26  61800.971670     전체
1273 2021-06-27  61946.972602     전체
1274 2021-06-28  61802.207245     전체
1275 2021-06-29  61335.188042     전체
1276 2021-06-30  60676.964569     전체

[1277 rows x 3 columns]

In [131]:
newyouth = pd.concat([youth , y_tot]).reset_index(drop = True)
newyouth

       base_date emd_nm         total
0     2018-01-01    건입동    967.851198
1     2018-01-01    구좌읍   1441.415541
2     2018-01-01    남원읍   1163.849546
3     2018-01-01    노형동   4225.454776
4     2018-01-01    대륜동   1353.922709
...          ...    ...           ...
56183 2021-06-26     전체  61800.971670
56184 2021-06-27     전체  61946.972602
56185 2021-06-28     전체  61802.207245
56186 2021-06-29     전체  61335.188042
56187 2021-06-30     전체  60676.964569

[56188 rows x 3 columns]

In [132]:
newyouth.rename(columns={'total':'youth_pop'},inplace=True)

In [147]:
newyouth.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56188 entries, 0 to 56187
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   base_date  56188 non-null  object
 1   emd_nm     56188 non-null  object
 2   youth_pop  56188 non-null  float64
dtypes: float64(1), object(2)
memory usage: 1.3+ MB

# merge 하기

In [201]:
waste=waste[['base_date','emd_nm','em_g']].groupby(['base_date','emd_nm']).sum().reset_index()

In [202]:
waste

        base_date emd_nm     em_g
0      2018-01-01    건입동  1708250
1      2018-01-01    남원읍  1239600
2      2018-01-01    노형동  9357900
3      2018-01-01    대륜동  1717700
4      2018-01-01    대정읍  1264950
...           ...    ...      ...
50517  2021-06-30    표선면  1377450
50518  2021-06-30    한경면   973850
50519  2021-06-30    한림읍  3298100
50520  2021-06-30    화북동  3749600
50521  2021-06-30    효돈동  1011050

[50522 rows x 3 columns]

In [203]:
waste_total = waste.groupby(['base_date'])[['em_g']].sum().reset_index()
waste_total['emd_nm'] = '전체'

In [204]:
waste_total = pd.concat([waste_total , waste]).reset_index(drop = True)

In [205]:
waste_total.drop(waste_total[waste_total['emd_nm']=='알수없음'].index,inplace=True)

In [206]:
waste_total

        base_date      em_g emd_nm
0      2018-01-01  85755000     전체
1      2018-01-02  90217650     전체
2      2018-01-03  80277600     전체
3      2018-01-04  80138700     전체
4      2018-01-05  75798600     전체
...           ...       ...    ...
51794  2021-06-30   1377450    표선면
51795  2021-06-30    973850    한경면
51796  2021-06-30   3298100    한림읍
51797  2021-06-30   3749600    화북동
51798  2021-06-30   1011050    효돈동

[50886 rows x 3 columns]

In [207]:
waste_total.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50886 entries, 0 to 51798
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   base_date  50886 non-null  object
 1   em_g       50886 non-null  int64
 2   emd_nm     50886 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.6+ MB

In [208]:
newyouth['base_date']=newyouth.base_date.astype('str')

In [209]:
total_data=pd.merge(waste_total,newyouth,left_on=['base_date','emd_nm'],right_on=['base_date','emd_nm'])

In [210]:
total_data

        base_date      em_g emd_nm     youth_pop
0      2018-01-01  85755000     전체  54466.952499
1      2018-01-02  90217650     전체  53973.690842
2      2018-01-03  80277600     전체  53705.165769
3      2018-01-04  80138700     전체  53151.118467
4      2018-01-05  75798600     전체  53360.869746
...           ...       ...    ...           ...
50881  2021-06-30   1377450    표선면    914.664667
50882  2021-06-30    973850    한경면    608.427552
50883  2021-06-30   3298100    한림읍   2064.041876
50884  2021-06-30   3749600    화북동   1810.431884
50885  2021-06-30   1011050    효돈동    283.896570

[50886 rows x 4 columns]

In [211]:
total_data=pd.merge(total_data,newt,left_on=['base_date','emd_nm'],right_on=['base_date','emd_nm'],how='left')

In [212]:
total_data

        base_date      em_g emd_nm     youth_pop  total_frgn_pop
0      2018-01-01  85755000     전체  54466.952499     2215.223209
1      2018-01-02  90217650     전체  53973.690842     2221.350506
2      2018-01-03  80277600     전체  53705.165769     2172.085577
3      2018-01-04  80138700     전체  53151.118467     2111.044522
4      2018-01-05  75798600     전체  53360.869746     2055.834760
...           ...       ...    ...           ...             ...
50881  2021-06-30   1377450    표선면    914.664667       12.910869
50882  2021-06-30    973850    한경면    608.427552       22.165953
50883  2021-06-30   3298100    한림읍   2064.041876       48.329788
50884  2021-06-30   3749600    화북동   1810.431884       18.483512
50885  2021-06-30   1011050    효돈동    283.896570        8.603778

[50886 rows x 5 columns]

In [213]:
total_data=total_data[['base_date','emd_nm','em_g','youth_pop','total_frgn_pop']]

In [214]:
total_data

        base_date emd_nm      em_g     youth_pop  total_frgn_pop
0      2018-01-01     전체  85755000  54466.952499     2215.223209
1      2018-01-02     전체  90217650  53973.690842     2221.350506
2      2018-01-03     전체  80277600  53705.165769     2172.085577
3      2018-01-04     전체  80138700  53151.118467     2111.044522
4      2018-01-05     전체  75798600  53360.869746     2055.834760
...           ...    ...       ...           ...             ...
50881  2021-06-30    표선면   1377450    914.664667       12.910869
50882  2021-06-30    한경면    973850    608.427552       22.165953
50883  2021-06-30    한림읍   3298100   2064.041876       48.329788
50884  2021-06-30    화북동   3749600   1810.431884       18.483512
50885  2021-06-30    효돈동   1011050    283.896570        8.603778

[50886 rows x 5 columns]

In [215]:
total_data.isnull().sum()

base_date         0
emd_nm            0
em_g              0
youth_pop         0
total_frgn_pop    0
dtype: int64

In [216]:
total_data.loc[total_data['total_frgn_pop'].isnull()]

Empty DataFrame
Columns: [base_date, emd_nm, em_g, youth_pop, total_frgn_pop]
Index: []

In [150]:
newt

        base_date emd_nm  total_frgn_pop
0      2018-01-01    건입동       53.709367
1      2018-01-01    구좌읍       38.530083
2      2018-01-01    남원읍       44.698131
3      2018-01-01    노형동      143.811278
4      2018-01-01    대륜동       26.507865
...           ...    ...             ...
54988  2021-06-26     전체      956.689204
54989  2021-06-27     전체      968.255603
54990  2021-06-28     전체      954.634028
54991  2021-06-29     전체      998.849240
54992  2021-06-30     전체     1015.214485

[54993 rows x 3 columns]

In [218]:
total_data.to_csv("youth_frgn_pop.csv")

In [225]:
final_train=pd.read_csv("eco jeju/merge_feature_210913.csv",)

In [229]:
final_train.drop(columns=['youth_pop','total_frgn_pop'],inplace=True)

In [232]:
final_train.drop(columns=['pay_amt'],inplace=True)

In [235]:
final_train=pd.merge(final_train,total_data,left_on=['base_date','emd_nm'],right_on=['base_date','emd_nm'],how='left')

In [237]:
final_train.drop(columns=['em_g_y','Unnamed: 0'],inplace=True)
final_train.rename(columns={'em_g_x':'em_g'},inplace=True)

In [240]:
final_train.to_csv("final_final_train_0913.csv")